
""" 0810_列表基本操作 """


# ----------------------------------------------------------

list1 = [ 4 , 11 , 7 , 29 , 9 , 28 , 4  ]


print ( 'list1 的長度', len ( list1 ) )
# 印出 -- list1 的長度 6


print ('list1 的最大值', max ( list1 ) )
# 印出 -- list1 的最大值 29


print ('list1 的最小值', min ( list1 ) )
# 印出 -- list1 的最小值 4


print ('list1 的 4 出現次數為', format ( list1.count(4) ) +'次')
# 印出 -- list1 的 4 出現次數為 2次


# ----------------------------------------------------------

list2 = [ 'a' , 'b' , 'c' ]


""" 結尾添加 e """ 
list2 .append ( 'e' )
print ( list2 )
# 印出 ['a', 'b', 'c', 'e']


""" 在 c e 中間 添加一個 d ( 第 3 個位置添加 d ) """
list2 .insert ( 3 ,'d' )
print ( list2 )
# 印出 ['a', 'b', 'c', 'd', 'e']


""" 刪除 b """
list2. remove('b')
print ( list2 )
# 印出 ['a', 'c', 'd', 'e']


""" 將 List2 第 0 個位置的 a，替換為 1 """
list2[0] = '1'
print ( list2 )
# 印出 ['1', 'c', 'd', 'e']


# ----------------------------------------------------------

list3 = [ 1 , 2 , 3 ]

""" 反向顯示 123 變成 321 """
list3. reverse()
print ( list3 )
# 印出 [3, 2, 1]


# ----------------------------------------------------------

list4 = [ 7 , 4 , 11 , 29 , 9 , 28 , -3 ]

""" 排序 """
list4.sort()
print ( list4 )
# 印出 [-3, 4, 7, 9, 11, 28, 29]


# ----------------------------------------------------------

list5 = [ 1 , 2 , 3 , 4 ]
c = list5 * 2 + [ 4 , 5 , 6 ]
print (c)
# 印出 [1, 2, 3, 4, 1, 2, 3, 4, 4, 5, 6]